gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    if (in == FALSE) {
        bpacket_create_p(bpacket, sender, receiver, request, BPACKET_CODE_SUCCESS, 0, NULL);
        esp32_uart_send_bpacket(bpacket);
    }

    closedir(directory);
    sd_card_close();

    return TRUE;
}

uint8_t sd_card_write_to_file(char* filePath, char* string, bpacket_t* bpacket) {

    // Save the address
    uint8_t request  = request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD Card could not open\0");
        return FALSE;
    }

    // Validate the path length
    if (chars_get_num_bytes(filePath) > MAX_PATH_LENGTH) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Filepath > 50 characters\0");
        return FALSE;
    }

    // Add SD card mount point to start of path
    char directory[MAX_PATH_LENGTH + 9];
    sprintf(directory, "%s/%s", MOUNT_POINT_PATH, filePath);

    if (sd_card_create_path(directory, bpacket) != TRUE) {
        return FALSE;
    }

    // Try open the file
    FILE* file = fopen(directory, "a+");

    if (file == NULL) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Filepath could not open\0");
        return FALSE;
    }

    fprintf(file, string);
    fclose(file);

    bpacket_create_p(bpacket, sender, receiver, request, BPACKET_CODE_SUCCESS, 0, NULL);
    return TRUE;
}

uint8_t sd_card_search_num_images(uint16_t* numImages, bpacket_t* bpacket) {

    // Save the address
    uint8_t request  = bpacket->request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        return FALSE;
    }

    // Confirm the directory for the images exists
    if (sd_card_create_path(IMAGE_DATA_FOLDER, bpacket) != TRUE) {
        return FALSE;
    }

    // Open the directory where the images are stored
    DIR* directory;
    directory = opendir(ROOT_IMAGE_DATA_FOLDER);
    if (directory == NULL) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Img dir could not open\0");
        return FALSE;
    }

    // Loop through each file and calculate the number of images
    struct dirent* dirPtr;
    *numImages = 0;
    while ((dirPtr = readdir(directory)) != NULL) {
        // Checking both img and IMG just incase as SD card is weird when it comes allowing/not allowing
        // lower case letters
        if (chars_contains(dirPtr->d_name, "img") == TRUE || chars_contains(dirPtr->d_name, "IMG") == TRUE) {
            *numImages += 1;
        }
    }

    return TRUE;
}

uint8_t sd_card_get_maximum_storage_capacity(uint16_t* maxStorageCapacityMb) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        return FALSE;
    }

    *maxStorageCapacityMb = (card->csd.capacity * card->csd.sector_size) / (1024 * 1024);

    sd_card_close();

    return TRUE;
}

uint8_t sd_card_save_image(uint8_t* imageData, int imageLength, bpacket_t* bpacket) {

    // Save the address
    uint8_t request  = bpacket->request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Extract the RTC and temperatre data from the bpacket
    ds18b20_temp_t temp1, temp2;
    dt_datetime_t datetime;
    uint8_t result = wd_bpacket_to_photo_data(bpacket, &datetime, &temp1, &temp2);

    if (result != TRUE) {
        char err[50];
        wd_get_error(result, err);
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_IN_PROGRESS, err);
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Could not open the SD card\0");
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    // Create the data folder path if required
    if (sd_card_create_path(IMAGE_DATA_FOLDER, bpacket) != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR,
                          "Could not create path to data folder\0");
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    // Create formatted image number in the format of xxx
    char imgNumString[8];
    sprintf(imgNumString, "%s%s%i", (imageNumber < 100) ? "0" : "", (imageNumber < 10) ? "0" : "", imageNumber);

    // Create formatted date time in the format yymmdd_hhmm
    char datetimeString[40];
    sprintf(datetimeString, "%i%s%i%s%i_%s%i%s%i", datetime.date.year - 2000, datetime.date.month < 10 ? "0" : "",
            datetime.date.month, datetime.date.day < 10 ? "0" : "", datetime.date.day,
            datetime.time.hour < 10 ? "0" : "", datetime.time.hour, datetime.time.minute < 10 ? "0" : "",
            datetime.time.minute);

    // Create path for image
    char filePath[80];
    sprintf(filePath, "%s/%s/img%s_%s.jpg", MOUNT_POINT_PATH, IMAGE_DATA_FOLDER, imgNumString, datetimeString);

    FILE* imageFile = fopen(filePath, "wb");
    if (imageFile == NULL) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Image file failed to open\0");
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    for (int i = 0; i < imageLength; i++) {
        fputc(imageData[i], imageFile);
    }

    fclose(imageFile);

    imageNumber++;
    return TRUE;
}

uint8_t sd_card_init(bpacket_t* bpacket) {

    // Update the image number
    if (sd_card_search_num_images(&imageNumber, bpacket) != TRUE) {
        return FALSE;
    }

    return TRUE;
}

void sd_card_copy_file(bpacket_t* bpacket, bpacket_char_array_t* bpacketCharArray) {

    // Save the address
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    bpacket_t b1;
    char j[305];

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {

        sprintf(j, "SD Card did not open\r\n");
        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
        esp32_uart_send_bpacket(&b1);

        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR,
                          "SD card failed to open\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

