gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
        case WATCHDOG_BPK_R_SET_CAMERA_SETTINGS:;

            bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                              "Request type set camera settings\r\n\0");
            esp32_uart_send_bpacket(&b1);

            wd_camera_settings_t cameraSettings;
            if (wd_bpacket_to_camera_settings(bpacket, &cameraSettings) != TRUE) {
                bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                                  "Bpacket to camera settings failed. SD Card write attempt\r\n\0");
                // Clean up
                fclose(file);
                sd_card_close();
                return FALSE;
            }

            if (fputc(cameraSettings.resolution, file) != cameraSettings.resolution) {
                bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                                  "FAILED TO WRITE FILE\r\n");
                esp32_uart_send_bpacket(&b1);
            }

            char j[50];
            sprintf(j, "Camera settings written to: %i\r\n", cameraSettings.resolution);
            bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
            esp32_uart_send_bpacket(&b1);

            break;

        case WATCHDOG_BPK_R_SET_CAPTURE_TIME_SETTINGS:;

            bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                              "Request settings capture time\r\n\0");
            esp32_uart_send_bpacket(&b1);

            wd_camera_capture_time_settings_t captureTime;
            if (wd_bpacket_to_capture_time_settings(bpacket, &captureTime) != TRUE) {
                bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                                  "Bpacket to capture time settings failed. SD Card write attempt\r\n\0");
                // Clean up
                fclose(file);
                sd_card_close();
                return FALSE;
            }

            // Skip the first byte as this is where the camera resolution is stored
            fseek(file, 1, SEEK_SET);
            fputc(captureTime.startTime.minute, file);
            fputc(captureTime.startTime.hour, file);
            fputc(captureTime.endTime.minute, file);
            fputc(captureTime.endTime.hour, file);
            fputc(captureTime.intervalTime.minute, file);
            fputc(captureTime.intervalTime.hour, file);

            bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                              "CApture time settings written to\r\n\0");
            esp32_uart_send_bpacket(&b1);

            break;

        default:;

            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                              "WF: Invalid request!\r\n\0");
            esp32_uart_send_bpacket(bpacket);
            return FALSE;
    }

    // Clean up
    fclose(file);
    sd_card_close();

    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Update bapacket to send as success response back
    bpacket->numBytes = 0;
    bpacket->receiver = sender;
    bpacket->sender   = receiver;
    bpacket->code     = BPACKET_CODE_SUCCESS;

    bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                      "Closing up!\r\n\0");
    esp32_uart_send_bpacket(&b1);

    return TRUE;
}

uint8_t sd_card_read_settings(bpacket_t* bpacket) {

    bpacket_t b1;

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                          "SD card failed to open\r\n\0");
        return FALSE;
    }

    // Confirm the file path to the settings exists
    // if (sd_card_create_path(SETTINGS_FOLDER_PATH_START_AT_ROOT, bpacket) != TRUE) {
    //     sd_card_close();
    //     return FALSE;
    // }

    // Confirm file path exists. Create it if it does not
    FILE* file = fopen(SETTINGS_FILE_PATH_START_AT_ROOT, "wb"); // write binary file
    if (file == NULL) {
        char msg[70];
        sprintf(msg, "Failed to open '%s' for writing. Error: %s", SETTINGS_FILE_PATH_START_AT_ROOT, strerror(errno));
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR, msg);
        sd_card_close();
        return FALSE;
    }

    // Get the size of the file in bytes
    fseek(file, 0L, SEEK_END);
    uint32_t fileNumBytes = ftell(file);
    fseek(file, 0L, SEEK_SET);

    if (fileNumBytes == 0) {

        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "RF: File was 0 bytes\r\n\0");
        esp32_uart_send_bpacket(&b1);

        // Close the file and write deafult settings to file
        fclose(file);
        sd_card_close();

        switch (bpacket->request) {

            case WATCHDOG_BPK_R_GET_CAMERA_SETTINGS:;

                bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                                  "RF: 0 bytes req was camera settings\r\n\0");
                esp32_uart_send_bpacket(&b1);

                wd_camera_settings_t deafultCameraSettings = {
                    .resolution = WD_CAM_RES_800x600,
                };

                bpacket_t deafultCameraSettingsBpacket;

                if (wd_camera_settings_to_bpacket(&deafultCameraSettingsBpacket, bpacket->receiver, bpacket->sender,
                                                  WATCHDOG_BPK_R_SET_CAMERA_SETTINGS, BPACKET_CODE_EXECUTE,
                                                  &deafultCameraSettings) != TRUE) {
                    bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                                      "Setting deafult camera settings failed\r\n\0");
                    esp32_uart_send_bpacket(bpacket);
                    return FALSE;
                }

                char j[50];
                sprintf(j, "RF: Writing default settings to file: %i", deafultCameraSettingsBpacket.bytes[0]);
                bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                                  j);
                esp32_uart_send_bpacket(&b1);

