gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
                sd_card_write_settings(&deafultCameraSettingsBpacket);

                break;

            case WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS:;

                wd_camera_capture_time_settings_t deafultCaptureTimeSettings = {
                    .startTime.second    = 0,
                    .startTime.minute    = 0,
                    .startTime.hour      = 9,
                    .endTime.second      = 0,
                    .endTime.minute      = 0,
                    .endTime.hour        = 17,
                    .intervalTime.second = 0,
                    .intervalTime.minute = 0,
                    .intervalTime.hour   = 3,
                };

                bpacket_t deafultCaptureTimeSettingsBpacket;

                if (wd_capture_time_settings_to_bpacket(&deafultCaptureTimeSettingsBpacket, bpacket->receiver,
                                                        bpacket->sender, bpacket->request, BPACKET_CODE_EXECUTE,
                                                        &deafultCaptureTimeSettings) != TRUE) {
                    bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                                      "Setting deafult camera settings failed\r\n\0");
                    esp32_uart_send_bpacket(bpacket);
                    return FALSE;
                }

                sd_card_write_settings(&deafultCaptureTimeSettingsBpacket);

                break;

            default:;

                bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                                  "RF: Invalid request!\r\n\0");
                esp32_uart_send_bpacket(bpacket);
                return FALSE;
        }

        // Open the SD card again
        if (sd_card_open() != TRUE) {
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                              "SD card failed to open\r\n\0");
            return FALSE;
        }

        // Open file again
        FILE* file = fopen(SETTINGS_FILE_PATH_START_AT_ROOT, "wb"); // write binary file
        if (file == NULL) {
            char msg[70];
            sprintf(msg, "Failed to open '%s' for writing. Error: %s", SETTINGS_FILE_PATH_START_AT_ROOT,
                    strerror(errno));
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR, msg);
            sd_card_close();
            return FALSE;
        }
    }

    bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                      "RF: Path opened\r\n\0");
    esp32_uart_send_bpacket(&b1);

    if (bpacket->request == WATCHDOG_BPK_R_GET_CAMERA_SETTINGS) {

        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "RF: Request get camera settings\r\n\0");
        esp32_uart_send_bpacket(&b1);

        wd_camera_settings_t cameraSettings;
        cameraSettings.resolution = fgetc(file);

        uint8_t result = wd_camera_settings_to_bpacket(bpacket, bpacket->sender, bpacket->receiver, bpacket->request,
                                                       BPACKET_CODE_SUCCESS, &cameraSettings);
        if (result != TRUE) {
            char errMsg[50];
            wd_get_error(result, errMsg);
            char j[80];
            sprintf(j, "FAIELD CRES: %i -> %i %s\r\n", cameraSettings.resolution, result, errMsg);
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR, j);
            esp32_uart_send_bpacket(bpacket);

            // Clean up
            fclose(file);
            sd_card_close();
            return FALSE;
        }

        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "RF: Converted settings to bpacket\r\n\0");
        esp32_uart_send_bpacket(&b1);
    }

    if (bpacket->request == WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS) {

        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "RF: Request get capture time\r\n\0");
        esp32_uart_send_bpacket(&b1);

        wd_camera_capture_time_settings_t captureTime;
        captureTime.startTime.minute    = fgetc(file);
        captureTime.startTime.hour      = fgetc(file);
        captureTime.endTime.minute      = fgetc(file);
        captureTime.endTime.hour        = fgetc(file);
        captureTime.intervalTime.minute = fgetc(file);
        captureTime.intervalTime.hour   = fgetc(file);

        if (wd_capture_time_settings_to_bpacket(bpacket, bpacket->sender, bpacket->receiver, bpacket->request,
                                                BPACKET_CODE_SUCCESS, &captureTime) != TRUE) {
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                              "Capture time settings to bpacket failed. SD Card read\r\n\0");

            // Clean up
            fclose(file);
            sd_card_close();
            return FALSE;
        }

        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "Capture time read\r\n\0");
        esp32_uart_send_bpacket(&b1);
    }

    // Clean up
    fclose(file);
    sd_card_close();

    bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                      "RF: Cleaning up\r\n\0");
    esp32_uart_send_bpacket(&b1);

    return TRUE;
}

/* GOOD FUNCTIONS */

uint8_t sd_card_open(void) {

    // Return if the sd card has already been mounted
    if (mounted != FALSE) {
        return TRUE;
    }

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();

    // This initializes the slot without card detect (CD) and write protect (WP) signals.
    // Modify slot_config.gpio_cd and slot_config.gpio_wp if your board has these signals.
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width               = 1;

    // Enable internal pullups on enabled pins. The internal pullups
    // are insufficient however, please make sure 10k external pullups are
    // connected on the bus. This is for debug / example purpose only.
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;

    // Mount the SD card
    esp_err_t ret = esp_vfs_fat_sdmmc_mount(MOUNT_POINT_PATH, &host, &slot_config, &sdCardConfiguration, &card);

    if (ret != ESP_OK) {

        if (ret == ESP_FAIL) {
            ESP_LOGE(SD_CARD_TAG, "Please reformat SD card");
            return SD_CARD_ERROR_UNREADABLE_CARD;
        }

